wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
static uint32_t appLastPressTick = 0U;

static DSTATUS appSdDiskStatus = STA_NOINIT;
static uint32_t appSdHalError = 0U;
static uint32_t appSdHalState = 0U;
static uint8_t appBspSdInitResult = 0xFFU;
static uint8_t appBspSdCardState = 0xFFU;
static BYTE appSdPhysicalDrive = 0xFFU;
static uint8_t appSdFailStage = 0U;
static uint8_t appSdReady = 0U;


typedef enum
{
    APP_FIELD_YEAR = 0,
    APP_FIELD_MONTH,
    APP_FIELD_DAY,
    APP_FIELD_HOUR,
    APP_FIELD_MINUTE,
    APP_FIELD_SECOND,
    APP_FIELD_COUNT
} APP_TimeFieldTypeDef;

static uint16_t setupYear = 2026U;
static uint8_t setupMonth = 1U;
static uint8_t setupDay = 1U;
static uint8_t setupHour = 0U;
static uint8_t setupMinute = 0U;
static uint8_t setupSecond = 0U;

static APP_TimeFieldTypeDef setupField = APP_FIELD_YEAR;

static FIL appSdFile;
static char appSdFilePath[40];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_ETH_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

static void APP_Init(void);
static void APP_Run(void);
static void APP_BootMenu(void);
static FRESULT APP_ClearAllHistory(void);
static uint8_t APP_ConfirmClearHistory(void);

static void APP_DrawInterface(void);
static void APP_DrawLeftPanel(void);

static void APP_DrawMilkButton(
    uint8_t buttonIndex,
    uint8_t pressed);

static void APP_DrawAllMilkButtons(void);

static void APP_InitTodayState(void);
static void APP_AddMilkRecord(uint16_t amountMl);
static FRESULT APP_AppendMilkRecord(const APP_MilkRecordTypeDef *record);
static FRESULT APP_LoadTodayRecords(void);
static void APP_InsertTodayRecord(const APP_MilkRecordTypeDef *record);
static FRESULT APP_DeleteRecord(uint32_t sourceOrdinal);
static void APP_DrawDeleteButton(void);
static void APP_GetHistoryPageRange(uint16_t *firstIndex,
                                    uint16_t *endIndex,
                                    uint16_t *totalPages);
static void APP_ProcessTouch(void);

static uint8_t APP_PointInRect(
    uint16_t touchX,
    uint16_t touchY,
    uint16_t rectX,
    uint16_t rectY,
    uint16_t rectWidth,
    uint16_t rectHeight);

static uint8_t APP_DaysInMonth(
    uint16_t year,
    uint8_t month);

static uint8_t APP_CalculateWeekDay(
    uint16_t year,
    uint8_t month,
    uint8_t day);

static uint8_t APP_RtcIsValid(void);

static FRESULT APP_SD_Test(void);
static void APP_ShowSdTestResult(FRESULT result);
static void APP_SD_CaptureHalState(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
static uint8_t APP_PointInRect(
    uint16_t touchX,
    uint16_t touchY,
    uint16_t rectX,
    uint16_t rectY,
    uint16_t rectWidth,
    uint16_t rectHeight)
{
    if ((touchX >= rectX) &&
        (touchX < (rectX + rectWidth)) &&
        (touchY >= rectY) &&
        (touchY < (rectY + rectHeight)))
    {
        return 1U;
    }

    return 0U;
}


static uint8_t APP_DaysInMonth(
    uint16_t year,
    uint8_t month)
{
    static const uint8_t days[] =
    {
        31U, 28U, 31U, 30U, 31U, 30U,
        31U, 31U, 30U, 31U, 30U, 31U
    };

    uint8_t result;

    if ((month < 1U) || (month > 12U))
    {
        return 31U;
    }

    result = days[month - 1U];

    if (month == 2U)
    {
        if (((year % 400U) == 0U) ||
            (((year % 4U) == 0U) &&
             ((year % 100U) != 0U)))
        {
            result = 29U;
        }
    }

    return result;
}


/*
 * 返回值符合 STM32 RTC：
 * Monday = 1 ... Sunday = 7
 */
static uint8_t APP_CalculateWeekDay(
    uint16_t year,
    uint8_t month,
    uint8_t day)
{
    static const uint8_t table[] =
    {
        0U, 3U, 2U, 5U, 0U, 3U,
        5U, 1U, 4U, 6U, 2U, 4U
    };

    uint32_t weekDay;

    if (month < 3U)
    {
        year--;
    }

    weekDay =
        (year +
         (year / 4U) -
         (year / 100U) +
         (year / 400U) +
         table[month - 1U] +
         day) % 7U;

    if (weekDay == 0U)
    {
        return RTC_WEEKDAY_SUNDAY;
    }

    return (uint8_t)weekDay;
}


static uint8_t APP_RtcIsValid(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != RTC_INIT_MAGIC)
    {
        return 0U;
    }
    if (HAL_RTC_GetTime(&hrtc, &rtcTime, RTC_FORMAT_BIN) != HAL_OK)
    {
        return 0U;
    }
    if (HAL_RTC_GetDate(&hrtc, &rtcDate, RTC_FORMAT_BIN) != HAL_OK)
    {
        return 0U;
    }

    return ((rtcDate.Month >= 1U) && (rtcDate.Month <= 12U) &&
            (rtcDate.Date >= 1U) && (rtcDate.Date <= 31U) &&
            (rtcTime.Hours <= 23U) && (rtcTime.Minutes <= 59U) &&
            (rtcTime.Seconds <= 59U)) ? 1U : 0U;
}

static void APP_LoadRtcTime(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    /*
     * RTC 已经设置过时，使用当前 RTC 值作为界面初始值。
     */
    if (HAL_RTCEx_BKUPRead(
            &hrtc,
            RTC_BKP_DR0) == RTC_INIT_MAGIC)
    {
        if (HAL_RTC_GetTime(
                &hrtc,
                &rtcTime,
                RTC_FORMAT_BIN) == HAL_OK)
        {
            if (HAL_RTC_GetDate(
                    &hrtc,
                    &rtcDate,
                    RTC_FORMAT_BIN) == HAL_OK)
            {
                setupYear = 2000U + rtcDate.Year;
                setupMonth = rtcDate.Month;
                setupDay = rtcDate.Date;
                setupHour = rtcTime.Hours;
                setupMinute = rtcTime.Minutes;
                setupSecond = rtcTime.Seconds;

                return;
            }
        }
    }

