wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    /*
     * RTC 尚未设置时使用默认值。
     */
    setupYear = 2026U;
    setupMonth = 1U;
    setupDay = 1U;
    setupHour = 0U;
    setupMinute = 0U;
    setupSecond = 0U;
}

static void APP_InitTodayState(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    /*
     * STM32 RTC 必须先读时间，再读日期。
     */
    if (HAL_RTC_GetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        Error_Handler();
    }

    if (HAL_RTC_GetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        Error_Handler();
    }

    appTodayYear = 2000U + rtcDate.Year;
    appTodayMonth = rtcDate.Month;
    appTodayDay = rtcDate.Date;

    appTodayTotalMl = 0U;
    appRecordCount = 0U;
    appHistoryPage = 0U;
    appSelectedRecordIndex = -1;
    appCsvRecordCount = 0U;
}


static void APP_DrawSetupButton(
    uint16_t x,
    uint16_t y,
    uint16_t width,
    uint16_t height,
    const char *text)
{
    uint16_t textWidth;
    uint16_t textX;
    uint16_t textY;

    BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    BSP_LCD_FillRect(x, y, width, height);

    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DrawRect(x, y, width, height);

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    textWidth = (uint16_t)(strlen(text) * Font16.Width);

    if (textWidth < width)
    {
        textX = x + ((width - textWidth) / 2U);
    }
    else
    {
        textX = x + 2U;
    }

    textY = y + ((height - Font16.Height) / 2U);

    BSP_LCD_DisplayStringAt(
        textX,
        textY,
        (uint8_t *)text,
        LEFT_MODE
    );
}


static void APP_DrawTimeSetupScreen(void)
{
    static const char *fieldNames[] =
    {
        "YEAR",
        "MONTH",
        "DAY",
        "HOUR",
        "MINUTE",
        "SECOND"
    };

    char text[50];

    BSP_LCD_Clear(LCD_COLOR_WHITE);

    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DisplayStringAt(
        0U,
        15U,
        (uint8_t *)"Set date and time",
        CENTER_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "%04u-%02u-%02u  %02u:%02u:%02u",
        setupYear,
        setupMonth,
        setupDay,
        setupHour,
        setupMinute,
        setupSecond
    );

    BSP_LCD_SetFont(&Font20);

    BSP_LCD_DisplayStringAt(
        0U,
        65U,
        (uint8_t *)text,
        CENTER_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "Editing: %s",
        fieldNames[setupField]
    );

    BSP_LCD_SetFont(&Font16);

    BSP_LCD_DisplayStringAt(
        0U,
        115U,
        (uint8_t *)text,
        CENTER_MODE
    );

    APP_DrawSetupButton(
        SET_MINUS_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "-"
    );

    APP_DrawSetupButton(
        SET_PLUS_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "+"
    );

    APP_DrawSetupButton(
        SET_NEXT_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "NEXT"
    );

    APP_DrawSetupButton(
        SET_SAVE_X,
        SET_BUTTON_Y,
        SET_BUTTON_WIDTH,
        SET_BUTTON_HEIGHT,
        "SAVE"
    );
}


static void APP_AdjustTime(int8_t direction)
{
    uint8_t maximumDay;

    switch (setupField)
    {
        case APP_FIELD_YEAR:
            if (direction > 0)
            {
                setupYear++;

                if (setupYear > 2099U)
                {
                    setupYear = 2000U;
                }
            }
            else
            {
                if (setupYear <= 2000U)
                {
                    setupYear = 2099U;
                }
                else
                {
                    setupYear--;
                }
            }
            break;

        case APP_FIELD_MONTH:
            if (direction > 0)
            {
                setupMonth++;

                if (setupMonth > 12U)
                {
                    setupMonth = 1U;
                }
            }
            else
            {
                if (setupMonth <= 1U)
                {
                    setupMonth = 12U;
                }
                else
                {
                    setupMonth--;
                }
            }
            break;

        case APP_FIELD_DAY:
            maximumDay =
                APP_DaysInMonth(setupYear, setupMonth);

            if (direction > 0)
            {
                setupDay++;

                if (setupDay > maximumDay)
                {
                    setupDay = 1U;
                }
            }
            else
            {
                if (setupDay <= 1U)
                {
                    setupDay = maximumDay;
                }
                else
                {
                    setupDay--;
                }
            }
            break;

        case APP_FIELD_HOUR:
            if (direction > 0)
            {
                setupHour =
                    (uint8_t)((setupHour + 1U) % 24U);
            }
            else
            {
                setupHour =
                    (setupHour == 0U) ? 23U :
                                       setupHour - 1U;
            }
            break;

        case APP_FIELD_MINUTE:
            if (direction > 0)
            {
                setupMinute =
                    (uint8_t)((setupMinute + 1U) % 60U);
            }
            else
            {
                setupMinute =
                    (setupMinute == 0U) ? 59U :
                                         setupMinute - 1U;
            }
            break;

        case APP_FIELD_SECOND:
            if (direction > 0)
            {
                setupSecond =
                    (uint8_t)((setupSecond + 1U) % 60U);
            }
            else
            {
                setupSecond =
                    (setupSecond == 0U) ? 59U :
                                         setupSecond - 1U;
            }
            break;

        default:
            break;
    }

