wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    /*
     * 调整年份或月份后，避免出现 2 月 31 日。
     */
    maximumDay = APP_DaysInMonth(
        setupYear,
        setupMonth
    );

    if (setupDay > maximumDay)
    {
        setupDay = maximumDay;
    }
}


static HAL_StatusTypeDef APP_SaveRtcTime(void)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    rtcTime.Hours = setupHour;
    rtcTime.Minutes = setupMinute;
    rtcTime.Seconds = setupSecond;
    rtcTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    rtcTime.StoreOperation = RTC_STOREOPERATION_RESET;

    if (HAL_RTC_SetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    rtcDate.WeekDay = APP_CalculateWeekDay(
        setupYear,
        setupMonth,
        setupDay
    );

    rtcDate.Month = setupMonth;
    rtcDate.Date = setupDay;
    rtcDate.Year = (uint8_t)(setupYear - 2000U);

    if (HAL_RTC_SetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    HAL_RTCEx_BKUPWrite(
        &hrtc,
        RTC_BKP_DR0,
        RTC_INIT_MAGIC
    );

    return HAL_OK;
}


static void APP_TimeSetupScreen(void)
{
    TS_StateTypeDef touchState = {0};

    uint8_t touching;
    uint8_t previousTouching = 0U;
    uint8_t setupFinished = 0U;

    uint16_t touchX;
    uint16_t touchY;

    APP_LoadRtcTime();
    setupField = APP_FIELD_YEAR;

    APP_DrawTimeSetupScreen();

    while (setupFinished == 0U)
    {
        if (BSP_TS_GetState(&touchState) == TS_OK)
        {
            touching =
                (touchState.touchDetected > 0U) ?
                1U : 0U;

            /*
             * 只处理刚按下的瞬间。
             */
            if ((touching != 0U) &&
                (previousTouching == 0U))
            {
                touchX = touchState.touchX[0];
                touchY = touchState.touchY[0];

                if (APP_PointInRect(
                        touchX,
                        touchY,
                        SET_MINUS_X,
                        SET_BUTTON_Y,
                        SET_BUTTON_WIDTH,
                        SET_BUTTON_HEIGHT) != 0U)
                {
                    APP_AdjustTime(-1);
                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_PLUS_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    APP_AdjustTime(1);
                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_NEXT_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    setupField =
                        (APP_TimeFieldTypeDef)
                        ((setupField + 1U) %
                         APP_FIELD_COUNT);

                    APP_DrawTimeSetupScreen();
                }
                else if (APP_PointInRect(
                             touchX,
                             touchY,
                             SET_SAVE_X,
                             SET_BUTTON_Y,
                             SET_BUTTON_WIDTH,
                             SET_BUTTON_HEIGHT) != 0U)
                {
                    if (APP_SaveRtcTime() == HAL_OK)
                    {
                        BSP_LCD_Clear(LCD_COLOR_WHITE);

                        BSP_LCD_SetFont(&Font20);
                        BSP_LCD_SetBackColor(
                            LCD_COLOR_WHITE);
                        BSP_LCD_SetTextColor(
                            LCD_COLOR_GREEN);

                        BSP_LCD_DisplayStringAt(
                            0U,
                            110U,
                            (uint8_t *)"RTC SAVED",
                            CENTER_MODE
                        );

                        HAL_Delay(500);
                        setupFinished = 1U;
                    }
                }
            }

            previousTouching = touching;
        }

        HAL_Delay(20);
    }
}

static FRESULT APP_ClearAllHistory(void)
{
    FIL file;
    FRESULT result;
    UINT written = 0U;
    static const char header[] = "date,time,amount_ml\r\n";

    if (appSdReady == 0U)
    {
        return FR_NOT_READY;
    }

    result = f_open(&file, appSdFilePath, FA_CREATE_ALWAYS | FA_WRITE);
    if (result != FR_OK)
    {
        return result;
    }
    if (result == FR_OK)
    {
        result = f_write(&file, header, sizeof(header) - 1U, &written);
        if ((result == FR_OK) && (written != (sizeof(header) - 1U)))
        {
            result = FR_DISK_ERR;
        }
    }
    if (result == FR_OK)
    {
        result = f_sync(&file);
    }
    if (result == FR_OK)
    {
        result = f_close(&file);
    }
    else
    {
        (void)f_close(&file);
    }

    if (result == FR_OK)
    {
        APP_InitTodayState();
    }
    return result;
}

static uint8_t APP_ConfirmClearHistory(void)
{
    TS_StateTypeDef state = {0};
    uint8_t previous = 0U;

    BSP_LCD_Clear(LCD_COLOR_WHITE);
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_RED);
    BSP_LCD_DisplayStringAt(0U, 55U,
        (uint8_t *)"DELETE ALL HISTORY?", CENTER_MODE);
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
    BSP_LCD_DisplayStringAt(0U, 105U,
        (uint8_t *)"This cannot be undone", CENTER_MODE);
    APP_DrawSetupButton(80U, 175U, 130U, 60U, "CANCEL");
    APP_DrawSetupButton(270U, 175U, 130U, 60U, "DELETE");

    do
    {
        (void)BSP_TS_GetState(&state);
        osDelay(20U);
    } while (state.touchDetected > 0U);

    for (;;)
    {
        if (BSP_TS_GetState(&state) == TS_OK)
        {
            uint8_t touching = (state.touchDetected > 0U) ? 1U : 0U;
            if ((touching != 0U) && (previous == 0U))
            {
                uint16_t x = state.touchX[0];
                uint16_t y = state.touchY[0];
                if (APP_PointInRect(x, y, 80U, 175U, 130U, 60U) != 0U)
                {
                    return 0U;
                }
                if (APP_PointInRect(x, y, 270U, 175U, 130U, 60U) != 0U)
                {
                    return 1U;
                }
            }
            previous = touching;
        }
        osDelay(20U);
    }
}

static void APP_BootMenu(void)
{
    TS_StateTypeDef state = {0};
    uint8_t previous = 0U;

    for (;;)
    {
        BSP_LCD_Clear(LCD_COLOR_WHITE);
        BSP_LCD_SetFont(&Font24);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_DisplayStringAt(0U, 20U,
            (uint8_t *)"MILK LOG", CENTER_MODE);

        APP_DrawSetupButton(APP_MENU_LEFT_X, APP_MENU_TOP_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "START");
        APP_DrawSetupButton(APP_MENU_RIGHT_X, APP_MENU_TOP_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "SET TIME");
        APP_DrawSetupButton(APP_MENU_LEFT_X, APP_MENU_BOTTOM_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "SD STATUS");
        APP_DrawSetupButton(APP_MENU_RIGHT_X, APP_MENU_BOTTOM_Y,
            APP_MENU_BUTTON_WIDTH, APP_MENU_BUTTON_HEIGHT, "CLEAR HISTORY");

