wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
        BSP_LCD_SetFont(&Font16);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        BSP_LCD_SetTextColor((appSdReady != 0U) ?
                             LCD_COLOR_GREEN : LCD_COLOR_RED);
        BSP_LCD_DisplayStringAt(0U, 245U,
            (uint8_t *)((appSdReady != 0U) ? "SD READY" : "SD ERROR"),
            CENTER_MODE);

        do
        {
            (void)BSP_TS_GetState(&state);
            osDelay(20U);
        } while (state.touchDetected > 0U);
        previous = 0U;
        for (;;)
        {
            if (BSP_TS_GetState(&state) == TS_OK)
            {
                uint8_t touching = (state.touchDetected > 0U) ? 1U : 0U;
                if ((touching != 0U) && (previous == 0U))
                {
                    uint16_t x = state.touchX[0];
                    uint16_t y = state.touchY[0];
                    if (APP_PointInRect(x, y, APP_MENU_LEFT_X,
                            APP_MENU_TOP_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        return;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_RIGHT_X,
                            APP_MENU_TOP_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        APP_TimeSetupScreen();
                        break;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_LEFT_X,
                            APP_MENU_BOTTOM_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        APP_ShowSdTestResult((appSdReady != 0U) ?
                                             FR_OK : FR_DISK_ERR);
                        break;
                    }
                    if (APP_PointInRect(x, y, APP_MENU_RIGHT_X,
                            APP_MENU_BOTTOM_Y, APP_MENU_BUTTON_WIDTH,
                            APP_MENU_BUTTON_HEIGHT) != 0U)
                    {
                        if ((APP_ConfirmClearHistory() != 0U) &&
                            (APP_ClearAllHistory() == FR_OK))
                        {
                            BSP_LCD_Clear(LCD_COLOR_WHITE);
                            BSP_LCD_SetFont(&Font20);
                            BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
                            BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
                            BSP_LCD_DisplayStringAt(0U, 110U,
                                (uint8_t *)"HISTORY CLEARED", CENTER_MODE);
                            osDelay(800U);
                        }
                        break;
                    }
                }
                previous = touching;
            }
            osDelay(20U);
        }
    }
}

static void APP_Init(void)
{
    FRESULT sdResult;
    /*
     * 初始化 LCD。
     */
    if (BSP_LCD_Init() != LCD_OK)
    {
        Error_Handler();
    }

    /*
     * LCD framebuffer 位于外部 SDRAM。
     */
    BSP_LCD_LayerDefaultInit(
        0U,
        LCD_FB_START_ADDRESS
    );

    BSP_LCD_SelectLayer(0U);
    BSP_LCD_SetLayerVisible(0U, ENABLE);
    BSP_LCD_DisplayOn();

    /*
     * 初始化触摸屏。
     */
    if (BSP_TS_Init(
            BSP_LCD_GetXSize(),
            BSP_LCD_GetYSize()) != TS_OK)
    {
        BSP_LCD_Clear(LCD_COLOR_WHITE);

        BSP_LCD_SetFont(&Font20);
        BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
        BSP_LCD_SetTextColor(LCD_COLOR_RED);

        BSP_LCD_DisplayStringAt(
            0U,
            110U,
            (uint8_t *)"Touch init failed",
            CENTER_MODE
        );

        Error_Handler();
    }

if (APP_RtcIsValid() == 0U)
{
    APP_TimeSetupScreen();
}

/*
 * 初始化、挂载并创建 CSV 文件。
 */
sdResult = APP_SD_Test();
appSdReady = (sdResult == FR_OK) ? 1U : 0U;

/*
 * 显示测试结果。
 */
if (sdResult != FR_OK)
{
    APP_ShowSdTestResult(sdResult);
}

APP_BootMenu();

/*
 * SD 测试完成后，进入六个奶量按钮界面。
 */
APP_InitTodayState();
(void)APP_LoadTodayRecords();
APP_DrawInterface();

appLastPressTick =
    HAL_GetTick() - APP_TOUCH_DEBOUNCE_MS;
}


static void APP_Run(void)
{
    while (1)
    {
        APP_ProcessTouch();
        osDelay(10U);
    }
}

static void APP_DrawInterface(void)
{
    BSP_LCD_Clear(LCD_COLOR_WHITE);

    /*
     * 左右分隔线。
     */
    BSP_LCD_SetTextColor(LCD_COLOR_GRAY);

    BSP_LCD_DrawVLine(
        APP_SEPARATOR_X,
        5U,
        BSP_LCD_GetYSize() - 10U
    );

    APP_DrawLeftPanel();
    APP_DrawAllMilkButtons();
    APP_DrawDeleteButton();

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor((appSdReady != 0U) ?
                         LCD_COLOR_GREEN : LCD_COLOR_RED);
    BSP_LCD_DisplayStringAt(442U, 5U,
                            (uint8_t *)"SD", LEFT_MODE);
}

static void APP_GetHistoryPageRange(uint16_t *firstIndex,
                                    uint16_t *endIndex,
                                    uint16_t *totalPages)
{
    uint16_t todayCount = 0U;
    uint16_t todayShown;
    uint16_t historyCount;

    while (todayCount < appRecordCount)
    {
        const APP_MilkRecordTypeDef *record =
            &appMilkRecords[appRecordCount - 1U - todayCount];
        if ((record->year != appTodayYear) ||
            (record->month != appTodayMonth) ||
            (record->day != appTodayDay))
        {
            break;
        }
        todayCount++;
    }

    todayShown = (todayCount > APP_RECORDS_PER_PAGE) ?
        APP_RECORDS_PER_PAGE : todayCount;
    historyCount = appRecordCount - todayShown;
    *totalPages = (uint16_t)(1U +
        ((historyCount + APP_RECORDS_PER_PAGE - 1U) /
         APP_RECORDS_PER_PAGE));

    if (appHistoryPage == 0U)
    {
        *endIndex = appRecordCount;
        *firstIndex = appRecordCount - todayShown;
    }
    else
    {
        uint16_t offset = (uint16_t)
            ((appHistoryPage - 1U) * APP_RECORDS_PER_PAGE);
        *endIndex = (historyCount > offset) ?
            (uint16_t)(historyCount - offset) : 0U;
        *firstIndex = (*endIndex > APP_RECORDS_PER_PAGE) ?
            (uint16_t)(*endIndex - APP_RECORDS_PER_PAGE) : 0U;
    }
}

static void APP_DrawLeftPanel(void)
{
    char text[40];
    uint16_t i;
    uint16_t firstIndex;
    uint16_t endIndex;
    uint16_t totalPages;
    uint16_t displayYear = appTodayYear;
    uint8_t displayMonth = appTodayMonth;
    uint8_t displayDay = appTodayDay;
    uint32_t displayTotal = 0U;
    uint16_t displayFeeds = 0U;
    const APP_MilkRecordTypeDef *displayLast = NULL;

