wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    /* Only show a record after it is safely synchronized to the SD card. */
    if (APP_AppendMilkRecord(&record) != FR_OK)
    {
        return;
    }

    record.sourceOrdinal = ++appCsvRecordCount;
    APP_InsertTodayRecord(&record);
    appHistoryPage = 0U;

    APP_DrawLeftPanel();
}

static void APP_InsertTodayRecord(const APP_MilkRecordTypeDef *record)
{
    uint16_t recordIndex;

    if ((record->year == appTodayYear) &&
        (record->month == appTodayMonth) &&
        (record->day == appTodayDay))
    {
        appTodayTotalMl += record->amountMl;
    }

    if (appRecordCount < APP_HISTORY_MAX_RECORDS)
    {
        recordIndex = appRecordCount++;
    }
    else
    {
        memmove(&appMilkRecords[0], &appMilkRecords[1],
                sizeof(appMilkRecords[0]) *
                    (APP_HISTORY_MAX_RECORDS - 1U));
        recordIndex = APP_HISTORY_MAX_RECORDS - 1U;
    }

    appMilkRecords[recordIndex] = *record;
}

static FRESULT APP_AppendMilkRecord(const APP_MilkRecordTypeDef *record)
{
    FIL file;
    FRESULT result;
    UINT bytesWritten = 0U;
    char line[48];
    int length;
    uint8_t fileOpen = 0U;

    length = snprintf(line, sizeof(line),
                      "%04u-%02u-%02u,%02u:%02u:%02u,%u\r\n",
                      record->year, record->month, record->day,
                      record->hour, record->minute, record->second,
                      record->amountMl);
    if ((length <= 0) || ((size_t)length >= sizeof(line)))
    {
        return FR_INVALID_PARAMETER;
    }

    result = f_open(&file, appSdFilePath, FA_OPEN_ALWAYS | FA_WRITE);
    if (result == FR_OK)
    {
        fileOpen = 1U;
        result = f_lseek(&file, f_size(&file));
    }
    if (result == FR_OK)
    {
        result = f_write(&file, line, (UINT)length, &bytesWritten);
        if ((result == FR_OK) && (bytesWritten != (UINT)length))
        {
            result = FR_DISK_ERR;
        }
    }
    if (result == FR_OK)
    {
        result = f_sync(&file);
    }

    if (fileOpen != 0U)
    {
        FRESULT closeResult = f_close(&file);
        if (result == FR_OK)
        {
            result = closeResult;
        }
    }
    return result;
}

static FRESULT APP_LoadTodayRecords(void)
{
    FIL file;
    FRESULT result;
    char line[64];

    result = f_open(&file, appSdFilePath, FA_READ);
    if (result != FR_OK)
    {
        return result;
    }

    appCsvRecordCount = 0U;

    while (f_gets(line, sizeof(line), &file) != NULL)
    {
        APP_MilkRecordTypeDef record;
        unsigned int year, month, day, hour, minute, second, amount;

        if (sscanf(line, "%u-%u-%u,%u:%u:%u,%u",
                   &year, &month, &day, &hour, &minute, &second,
                   &amount) != 7)
        {
            continue;
        }

        if ((month < 1U) || (month > 12U) || (day < 1U) ||
            (day > 31U) || (hour > 23U) || (minute > 59U) ||
            (second > 59U) || (amount > 65535U))
        {
            continue;
        }

        record.year = (uint16_t)year;
        record.month = (uint8_t)month;
        record.day = (uint8_t)day;
        record.hour = (uint8_t)hour;
        record.minute = (uint8_t)minute;
        record.second = (uint8_t)second;
        record.amountMl = (uint16_t)amount;
        record.sourceOrdinal = ++appCsvRecordCount;
        APP_InsertTodayRecord(&record);
    }

    result = f_error(&file);
    {
        FRESULT closeResult = f_close(&file);
        if (result == FR_OK)
        {
            result = closeResult;
        }
    }
    return result;
}

static FRESULT APP_DeleteRecord(uint32_t sourceOrdinal)
{
    FIL source;
    FIL temp;
    FRESULT result;
    char line[64];
    char tempPath[24];
    char backupPath[24];
    uint32_t ordinal = 0U;

    snprintf(tempPath, sizeof(tempPath), "%sMILKTMP.CSV", SDPath);
    snprintf(backupPath, sizeof(backupPath), "%sMILKBAK.CSV", SDPath);
    (void)f_unlink(tempPath);
    (void)f_unlink(backupPath);

    result = f_open(&source, appSdFilePath, FA_READ);
    if (result != FR_OK)
    {
        return result;
    }
    result = f_open(&temp, tempPath, FA_CREATE_ALWAYS | FA_WRITE);
    if (result != FR_OK)
    {
        (void)f_close(&source);
        return result;
    }

    while ((result == FR_OK) && (f_gets(line, sizeof(line), &source) != NULL))
    {
        unsigned int y, mo, d, h, mi, s, amount;
        UINT written = 0U;
        UINT length = (UINT)strlen(line);

        if (sscanf(line, "%u-%u-%u,%u:%u:%u,%u",
                   &y, &mo, &d, &h, &mi, &s, &amount) == 7)
        {
            ordinal++;
            if (ordinal == sourceOrdinal)
            {
                continue;
            }
        }

        result = f_write(&temp, line, length, &written);
        if ((result == FR_OK) && (written != length))
        {
            result = FR_DISK_ERR;
        }
    }

    if (result == FR_OK)
    {
        result = f_error(&source);
    }
    if (result == FR_OK)
    {
        result = f_sync(&temp);
    }
    (void)f_close(&source);
    {
        FRESULT closeResult = f_close(&temp);
        if (result == FR_OK)
        {
            result = closeResult;
        }
    }

    if (result != FR_OK)
    {
        (void)f_unlink(tempPath);
        return result;
    }

    result = f_rename(appSdFilePath, backupPath);
    if (result == FR_OK)
    {
        result = f_rename(tempPath, appSdFilePath);
        if (result == FR_OK)
        {
            (void)f_unlink(backupPath);
        }
        else
        {
            (void)f_rename(backupPath, appSdFilePath);
        }
    }
    return result;
}


static void APP_ProcessTouch(void)
{
    static uint8_t previousTouching = 0U;
    static int8_t activeButtonIndex = -1;
    static uint8_t historyTouchActive = 0U;
    static uint16_t historyTouchStartY = 0U;
    static uint16_t historyTouchLastY = 0U;

    uint8_t touching;
    uint8_t i;

    uint16_t touchX;
    uint16_t touchY;

    uint32_t currentTick;

    if (BSP_TS_GetState(&appTouchState) != TS_OK)
    {
        return;
    }

