wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    touching =
        (appTouchState.touchDetected > 0U) ?
        1U : 0U;

    /*
     * 刚刚按下。
     */
    if ((touching != 0U) &&
        (previousTouching == 0U))
    {
        touchX = appTouchState.touchX[0];
        touchY = appTouchState.touchY[0];

        if (touchX < APP_SEPARATOR_X)
        {
            historyTouchActive = 1U;
            historyTouchStartY = touchY;
            historyTouchLastY = touchY;
        }

        currentTick = HAL_GetTick();

        if ((currentTick - appLastPressTick) >=
            APP_TOUCH_DEBOUNCE_MS)
        {
            if ((appSelectedRecordIndex >= 0) &&
                (APP_PointInRect(touchX, touchY, APP_DELETE_X,
                                 APP_DELETE_Y, APP_DELETE_WIDTH,
                                 APP_DELETE_HEIGHT) != 0U))
            {
                appLastPressTick = currentTick;
                if (APP_DeleteRecord(
                        appMilkRecords[appSelectedRecordIndex].sourceOrdinal)
                    == FR_OK)
                {
                    APP_InitTodayState();
                    (void)APP_LoadTodayRecords();
                    APP_DrawInterface();
                }
            }

            for (i = 0U;
                 i < APP_MILK_BUTTON_COUNT;
                 i++)
            {
                if (APP_PointInRect(
                        touchX,
                        touchY,
                        appMilkButtons[i].x,
                        appMilkButtons[i].y,
                        appMilkButtons[i].width,
                        appMilkButtons[i].height) != 0U)
                {
                    appLastPressTick = currentTick;
                    activeButtonIndex = (int8_t)i;

                    APP_DrawMilkButton(i, 1U);

                    APP_AddMilkRecord(
                        appMilkButtons[i].amountMl
                    );

                    break;
                }
            }
        }
    }

    if ((touching != 0U) && (historyTouchActive != 0U))
    {
        historyTouchLastY = appTouchState.touchY[0];
    }

    /*
     * 手指松开。
     */
    if ((touching == 0U) &&
        (previousTouching != 0U))
    {
        if (historyTouchActive != 0U)
        {
            int32_t swipe = (int32_t)historyTouchStartY -
                            (int32_t)historyTouchLastY;
            uint16_t firstIndex;
            uint16_t endIndex;
            uint16_t totalPages;

            APP_GetHistoryPageRange(&firstIndex, &endIndex, &totalPages);

            if ((swipe >= (int32_t)APP_HISTORY_SWIPE_PIXELS) &&
                ((appHistoryPage + 1U) < totalPages))
            {
                appHistoryPage++;
                appSelectedRecordIndex = -1;
                APP_DrawLeftPanel();
                APP_DrawDeleteButton();
            }
            else if ((swipe <= -(int32_t)APP_HISTORY_SWIPE_PIXELS) &&
                     (appHistoryPage > 0U))
            {
                appHistoryPage--;
                appSelectedRecordIndex = -1;
                APP_DrawLeftPanel();
                APP_DrawDeleteButton();
            }
            else if ((swipe < (int32_t)APP_HISTORY_SWIPE_PIXELS) &&
                     (swipe > -(int32_t)APP_HISTORY_SWIPE_PIXELS) &&
                     (historyTouchLastY >= APP_RECORD_Y))
            {
                uint16_t row = (uint16_t)
                    ((historyTouchLastY - APP_RECORD_Y) /
                     APP_RECORD_LINE_HEIGHT);
                uint16_t firstIndex;
                uint16_t endIndex;
                uint16_t totalPages;
                uint16_t pageCount;

                APP_GetHistoryPageRange(&firstIndex, &endIndex, &totalPages);
                pageCount = endIndex - firstIndex;

                if (row < pageCount)
                {
                    appSelectedRecordIndex =
                        (int16_t)(endIndex - 1U - row);
                    APP_DrawLeftPanel();
                    APP_DrawDeleteButton();
                }
            }

            historyTouchActive = 0U;
        }

        if (activeButtonIndex >= 0)
        {
            APP_DrawMilkButton(
                (uint8_t)activeButtonIndex,
                0U
            );

            activeButtonIndex = -1;
        }
    }

    previousTouching = touching;
}

static FRESULT APP_SD_Test(void)
{
    FRESULT result = FR_OK;
    FRESULT closeResult = FR_OK;
    UINT bytesWritten = 0U;

    static const char csvHeader[] =
        "date,time,amount_ml\r\n";

    appBspSdInitResult = 0xFFU;
    appBspSdCardState = 0xFFU;
    appSdDiskStatus = STA_NOINIT;
    appSdHalError = 0U;
    appSdHalState = 0U;
    appSdPhysicalDrive = 0xFFU;
    appSdFailStage = 0U;

    /*
     * SDPath 应为 "0:/"。
     */
    if ((SDPath[0] < '0') ||
        (SDPath[0] > '9'))
    {
        return FR_INVALID_DRIVE;
    }

    appSdPhysicalDrive =
        (BYTE)(SDPath[0] - '0');

    /*
     * 此处由 sd_diskio.c 内部调用 BSP_SD_Init()。
     */
    appSdDiskStatus =
        disk_initialize(appSdPhysicalDrive);

    osDelay(50U);

    appBspSdCardState =
        BSP_SD_GetCardState();

    appSdHalError =
        HAL_SD_GetError(&hsd1);

    appSdHalState =
        (uint32_t)HAL_SD_GetState(&hsd1);

    /*
     * BSP 显示值根据磁盘初始化结果记录。
     */
    if ((appSdDiskStatus & STA_NOINIT) != 0U)
    {
        appBspSdInitResult = MSD_ERROR;
        appSdFailStage = 1U;
        APP_SD_CaptureHalState();
        return FR_NOT_READY;
    }

    appBspSdInitResult = MSD_OK;

    /*
     * 挂载文件系统。
     */
    appSdFailStage = 2U;
    result = f_mount(
        &SDFatFS,
        (TCHAR const *)SDPath,
        1U
    );

    if (result != FR_OK)
    {
        APP_SD_CaptureHalState();
        return result;
    }

    snprintf(
        appSdFilePath,
        sizeof(appSdFilePath),
        "%sMILKLOG.CSV",
        SDPath
    );

    appSdFailStage = 3U;
    result = f_open(
        &appSdFile,
        appSdFilePath,
        FA_OPEN_ALWAYS | FA_WRITE
    );

    if (result != FR_OK)
    {
        APP_SD_CaptureHalState();
        (void)f_mount(
            NULL,
            (TCHAR const *)SDPath,
            1U
        );

        return result;
    }

    if (f_size(&appSdFile) == 0U)
    {
        appSdFailStage = 4U;
        result = f_write(
            &appSdFile,
            csvHeader,
            sizeof(csvHeader) - 1U,
            &bytesWritten
        );

        if ((result == FR_OK) &&
            (bytesWritten !=
             (sizeof(csvHeader) - 1U)))
        {
            result = FR_DISK_ERR;
        }

