wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
        if (result == FR_OK)
        {
            appSdFailStage = 5U;
            result = f_sync(&appSdFile);
        }

        if (result != FR_OK)
        {
            APP_SD_CaptureHalState();
        }
    }

    if (result == FR_OK)
    {
        appSdFailStage = 6U;
    }
    closeResult =
        f_close(&appSdFile);

    if (result == FR_OK)
    {
        result = closeResult;
    }

    APP_SD_CaptureHalState();
    if (result == FR_OK)
    {
        appSdFailStage = 0U;
    }
    return result;
}

static void APP_SD_CaptureHalState(void)
{
    appBspSdCardState = BSP_SD_GetCardState();
    appSdHalError = HAL_SD_GetError(&hsd1);
    appSdHalState = (uint32_t)HAL_SD_GetState(&hsd1);
}

static void APP_ShowSdTestResult(FRESULT result)
{
    char text[48];

    BSP_LCD_Clear(LCD_COLOR_WHITE);

    /*
     * 标题。
     */
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

    if (result == FR_OK)
    {
        BSP_LCD_SetTextColor(LCD_COLOR_GREEN);

        BSP_LCD_DisplayStringAt(
            0U,
            45U,
            (uint8_t *)"SD CARD OK",
            CENTER_MODE
        );
    }
    else
    {
        BSP_LCD_SetTextColor(LCD_COLOR_RED);

        BSP_LCD_DisplayStringAt(
            0U,
            45U,
            (uint8_t *)"SD CARD ERROR",
            CENTER_MODE
        );
    }

    /*
     * 诊断信息。
     */
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    /*
     * FatFs 和 BSP 初始化结果。
     */
    snprintf(
        text,
        sizeof(text),
        "FatFs: %u  BSP: %u",
        (unsigned int)result,
        (unsigned int)appBspSdInitResult
    );

    BSP_LCD_DisplayStringAt(
        0U,
        90U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /*
     * 磁盘状态和物理盘号。
     */
    snprintf(
        text,
        sizeof(text),
        "Disk: %02X Drive:%u Stage:%u",
        (unsigned int)appSdDiskStatus,
        (unsigned int)appSdPhysicalDrive,
        (unsigned int)appSdFailStage
    );

    BSP_LCD_DisplayStringAt(
        0U,
        115U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /*
     * SD 卡传输状态。
     */
    snprintf(
        text,
        sizeof(text),
        "Card state: %u",
        (unsigned int)appBspSdCardState
    );

    BSP_LCD_DisplayStringAt(
        0U,
        140U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /*
     * HAL SD 状态。
     */
    snprintf(
        text,
        sizeof(text),
        "HAL state: %lu",
        (unsigned long)appSdHalState
    );

    BSP_LCD_DisplayStringAt(
        0U,
        165U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /*
     * HAL SD 错误码。
     */
    snprintf(
        text,
        sizeof(text),
        "HAL error: 0x%08lX",
        (unsigned long)appSdHalError
    );

    BSP_LCD_DisplayStringAt(
        0U,
        190U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /*
     * 显示 SDPath。
     */
    snprintf(
        text,
        sizeof(text),
        "Path: %s",
        SDPath
    );

    BSP_LCD_DisplayStringAt(
        0U,
        215U,
        (uint8_t *)text,
        CENTER_MODE
    );

    /* Success only needs a brief confirmation; keep errors visible for debug. */
    osDelay((result == FR_OK) ? 1500U : 10000U);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  // MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_DMA2D_Init();
  MX_ETH_Init();
  MX_FMC_Init();
  MX_I2C1_Init();
  MX_I2C3_Init();
  MX_LTDC_Init();
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_SAI2_Init();
  MX_SDMMC1_SD_Init();
  MX_SPDIFRX_Init();
  MX_SPI2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_FATFS_Init();
  /* USER CODE BEGIN 2 */


  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 4096);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

